[NoCoverage] StringLiteral
src/app/app.component.ts:18:57
 export class AppComponent {
   name: string;
   contacts: Contact[] = [
-    { id: 4, firstName: 'Sam', surname: 'Smith', email: 'sam.smith@music.com' },
+    { id: 4, firstName: 'Sam', surname: 'Smith', email: "" },
     {
       id: 8,

[NoCoverage] StringLiteral
src/app/app.component.ts:21:18
     { id: 4, firstName: 'Sam', surname: 'Smith', email: 'sam.smith@music.com' },
     {
       id: 8,
-      firstName: 'Frank',
+      firstName: "",
       surname: 'Muscles',
       email: 'frank@muscles.com',

[NoCoverage] StringLiteral
src/app/app.component.ts:22:16
     {
       id: 8,
       firstName: 'Frank',
-      surname: 'Muscles',
+      surname: "",
       email: 'frank@muscles.com',
     },

[NoCoverage] StringLiteral
src/app/app.component.ts:23:14
       id: 8,
       firstName: 'Frank',
       surname: 'Muscles',
-      email: 'frank@muscles.com',
+      email: "",
     },
     {

[NoCoverage] StringLiteral
src/app/app.component.ts:28:16
     {
       id: 15,
       firstName: 'Eddy',
-      surname: 'Valentino',
+      surname: "",
       email: 'eddy@valfam.co.uk',
     },

[NoCoverage] StringLiteral
src/app/app.component.ts:29:14
       id: 15,
       firstName: 'Eddy',
       surname: 'Valentino',
-      email: 'eddy@valfam.co.uk',
+      email: "",
     },
   ];

[NoCoverage] BlockStatement
src/app/app.component.ts:33:34
     },
   ];
 
-  contactAdded(contact: Contact) {
-    console.log(`Contact added: ${contact.firstName} ${contact.surname}`);
-  }
+  contactAdded(contact: Contact) {}
 
   constructor() {

[NoCoverage] BlockStatement
src/app/app.component.ts:37:17
     console.log(`Contact added: ${contact.firstName} ${contact.surname}`);
   }
 
-  constructor() {
-    this.name = 'Angular!';
-  }
+  constructor() {}
 }
 
