[NoCoverage] BooleanLiteral
src/app/app.config.ts:7:61
 import { routes } from './app.routes';
 
 export const appConfig: ApplicationConfig = {
-  providers: [provideZoneChangeDetection({ eventCoalescing: true }), provideRouter(routes)]
+  providers: [provideZoneChangeDetection({ eventCoalescing: false }), provideRouter(routes)]
 };
 

[NoCoverage] ArrayDeclaration
src/app/app.config.ts:7:14
 import { routes } from './app.routes';
 
 export const appConfig: ApplicationConfig = {
-  providers: [provideZoneChangeDetection({ eventCoalescing: true }), provideRouter(routes)]
+  providers: []
 };
 
