[NoCoverage] BlockStatement
src/app/contact-list/contact-list.component.ts:15:47
 export class ContactListComponent {
   contacts = input.required<Contact[]>();
 
-  updateColor(contact: Contact, event: Event) {
-    const htmlinput = event.target as HTMLInputElement;
-
-    const index = this.contacts().indexOf(contact);
-    this.contacts()[index] = { ...contact, color: htmlinput.value };
-  }
+  updateColor(contact: Contact, event: Event) {}
 
   deleteContact(contact: Contact) {

[NoCoverage] BlockStatement
src/app/contact-list/contact-list.component.ts:22:35
     this.contacts()[index] = { ...contact, color: htmlinput.value };
   }
 
-  deleteContact(contact: Contact) {
-    this.contacts().splice(this.contacts().indexOf(contact), 1);
-  }
+  deleteContact(contact: Contact) {}
 
   editContact(contact: Contact) {

[NoCoverage] BlockStatement
src/app/contact-list/contact-list.component.ts:26:33
     this.contacts().splice(this.contacts().indexOf(contact), 1);
   }
 
-  editContact(contact: Contact) {
-    const index = this.contacts().indexOf(contact);
-    this.contacts()[index] = { ...contact };
-
-    console.log(this.contacts);
-  }
+  editContact(contact: Contact) {}
 }
 
