[NoCoverage] BlockStatement
src/app/dp-contact-form/dp-contact-form.component.ts:23:28
     surname: '',
   };
 
-  addContact(form: NgForm) {
-    this.contacts().push(this.newContact);
-    this.contactAdded.emit(this.newContact);
-    this.newContact = {
-      id: 0,
-      email: '',
-      firstName: '',
-      surname: '',
-    };
-    form.reset();
-  }
+  addContact(form: NgForm) {}
 }
 

[NoCoverage] StringLiteral
src/app/dp-contact-form/dp-contact-form.component.ts:28:14
     this.contactAdded.emit(this.newContact);
     this.newContact = {
       id: 0,
-      email: '',
+      email: "Stryker was here!",
       firstName: '',
       surname: '',

[NoCoverage] StringLiteral
src/app/dp-contact-form/dp-contact-form.component.ts:30:16
       id: 0,
       email: '',
       firstName: '',
-      surname: '',
+      surname: "Stryker was here!",
     };
     form.reset();
