[Killed] BlockStatement
src/app/contact-name/contact-name.pipe.ts:6:40
 
 @Pipe({ name: 'contactName', standalone: true })
 export class ContactNamePipe implements PipeTransform {
-    transform(value: Contact) : string {
-        return `${value.firstName} ${value.surname}`;
-    }
+    transform(value: Contact) : string {}
 }
killedBy: ContactListComponent should show 2 contacts when 2 contacts are bound
statusReason: Expected undefined to be 'John Doe'.

[Killed] StringLiteral
src/app/contact-name/contact-name.pipe.ts:7:16
 @Pipe({ name: 'contactName', standalone: true })
 export class ContactNamePipe implements PipeTransform {
     transform(value: Contact) : string {
-        return `${value.firstName} ${value.surname}`;
+        return ``;
     }
 }
killedBy: ContactNamePipe Should give correct contact name
statusReason: Expected '' to be 'John Doe'.
